{
    "id": "multi-step-form-autosave",
    "title": "Multi-step Form",
    "description": "Design a 4-step form with validation, step transitions, a progress bar, and automatic autosave to localStorage. Users should be able to refresh or leave the page and continue where they left off. Focus on form architecture, autosave timing, validation strategy, and a resilient resume flow.\n\nFunctional requirements:\n- Render a multi-step form with Next/Back navigation and a progress indicator.\n- Validate fields per step (inline or on submit) and prevent invalid progression.\n- Autosave form state to localStorage on a throttled/debounced cadence.\n- Restore the last saved step and field values on reload.\n- Allow users to discard a draft and start fresh.\n- Submit the full form and clear the saved draft on success.\n\nNon-functional:\n- Autosave must not block typing or cause UI jank.\n- Step transitions should be smooth and preserve in-progress input.\n- Draft restore must handle schema changes or invalid saved data gracefully.\n- Accessible keyboard and screen reader behavior across steps.\n- Clear UX states for validation errors and save status.\n\nData constraints:\n- Store a compact JSON draft plus current step index.\n- Draft versioning may be needed to handle schema updates.\n- LocalStorage size is limited; avoid large, nested blobs.\n",
    "tags": [
        "forms",
        "autosave",
        "validation",
        "local-storage"
    ],
    "type": "system-design",
    "sections": [
        {
            "key": "R",
            "title": "Requirements exploration",
            "file": "requirements.json"
        },
        {
            "key": "A",
            "title": "Architecture / High-level design",
            "file": "architecture.json"
        },
        {
            "key": "D",
            "title": "Data model",
            "file": "data.json"
        },
        {
            "key": "I",
            "title": "Interface definition (API)",
            "file": "interfaces.json"
        },
        {
            "key": "O",
            "title": "Optimizations and deep dive",
            "file": "optimizations.json"
        }
    ]
}
