{
    "key": "O",
    "title": "Optimizations & Deep dive",
    "blocks": [
        {
            "type": "text",
            "text": "In this final step, the interviewer wants to see if you can spot where a toast system might break in a real app and how you’d improve it. You should talk about performance (many toasts, frequent updates), timers and cleanup, accessibility details, z-index issues, and how you’d keep the UX sane on different devices."
        },
        {
            "type": "divider"
        },
        {
            "type": "columns",
            "columns": [
                {
                    "blocks": [
                        {
                            "type": "text",
                            "text": "**How you should frame optimizations:**\n\"I’d first ship a simple but correct version: global store, portal, timers, basic ARIA. Then I’d look at actual usage: what happens if many toasts fire? How does it feel on slower devices? Based on that, I’d tune max visible toasts, animations, stacking behavior, and accessibility details.\""
                        }
                    ]
                },
                {
                    "blocks": [
                        {
                            "type": "text",
                            "text": "**What the interviewer listens for:**\n- You start from a working baseline and then optimize based on real problems.\n- You know common pain points: too many toasts, janky animations, timer leaks.\n- You can go deeper on at least one topic (e.g. timers, accessibility, responsive layout).\n- You think about both **UX polish** and **technical robustness**."
                        }
                    ]
                }
            ]
        },
        {
            "type": "callout",
            "variant": "info",
            "title": "How you should act here",
            "text": "Pick a few realistic scenarios: \"user triggers many toasts quickly\", \"mobile layout is cramped\", \"screen reader users\", and walk through how you’d detect problems and improve them. Sound like someone who has actually seen toast systems misbehave in production."
        },
        {
            "type": "divider"
        },
        {
            "type": "columns",
            "columns": [
                {
                    "blocks": [
                        {
                            "type": "checklist",
                            "title": "Baseline hygiene you should mention",
                            "items": [
                                "Limit the **maximum number of visible toasts** (e.g. 3–5) and remove or queue older ones.",
                                "Ensure timers are always **cleared on unmount** or when toasts are removed.",
                                "Pause auto-dismiss while the user **hovers** or focuses a toast (so they can read or click).",
                                "Debounce or collapse identical messages (e.g. repeated \"Network error\" toasts).",
                                "Use **CSS transitions** for enter/exit animations instead of heavy JS-based animation loops."
                            ]
                        }
                    ]
                },
                {
                    "blocks": [
                        {
                            "type": "checklist",
                            "title": "Accessibility and UX deep-dive points",
                            "items": [
                                "Use appropriate **ARIA roles**: `status` for non-urgent info, `alert` for critical errors.",
                                "Announce only the **important text** to screen readers, not decorative content.",
                                "For interactive toasts with buttons, ensure **focus is visible** and keyboard navigation works.",
                                "Respect **reduced motion** preferences by disabling or simplifying animations.",
                                "On mobile, consider **full-width** toasts at top/bottom with larger touch targets."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "type": "table",
            "title": "Deep-dive topics you can offer",
            "columns": [
                "Topic",
                "Angle",
                "How you talk about it"
            ],
            "rows": [
                [
                    "Z-index and layering",
                    "Toasts vs modals vs dropdowns",
                    "\"I’d pick a dedicated z-index range for toasts so they appear above normal content but don’t unexpectedly cover modal dialogs unless we explicitly want that. This avoids random layering bugs across the app.\""
                ],
                [
                    "Handling toast storms",
                    "Too many notifications",
                    "\"If a feature fires a lot of toasts in a short time, I’d cap the visible count and either drop the oldest ones or group them (e.g. '5 new notifications') instead of flooding the screen.\""
                ],
                [
                    "Route changes",
                    "Navigation & cleanup",
                    "\"On navigation, I’d decide whether to keep or clear toasts. For most flows I’d clear them to avoid old messages leaking into a new context, and in all cases I’d ensure timers are cleaned up.\""
                ],
                [
                    "Performance on low-end devices",
                    "Avoid jank",
                    "\"I’d keep toast components lightweight, avoid heavy shadows/filters, and reuse layout classes. If profiling shows jank, I’d simplify the toast UI and animations first, before any complex tricks.\""
                ],
                [
                    "Action toasts (Undo)",
                    "State consistency",
                    "\"For actions like 'Undo', I’d make sure the toast’s action callback works well with the rest of the app’s state, and that the toast doesn’t disappear before the user has a chance to act if they’re interacting with it.\""
                ]
            ]
        },
        {
            "type": "steps",
            "title": "Optimization path you should describe",
            "steps": [
                {
                    "title": "1. Ship a clean baseline",
                    "text": "Global store, portal-based rendering, maxVisible, basic ARIA roles, auto-dismiss with proper cleanup, simple stacking."
                },
                {
                    "title": "2. Observe usage",
                    "text": "See how many toasts are typically active, which variants are used most, and whether users trigger bursts of notifications."
                },
                {
                    "title": "3. Fix obvious pain points",
                    "text": "Cap visible toasts, add hover/focus pause, tweak durations (shorter for success, longer for errors), and reduce noisy duplicates."
                },
                {
                    "title": "4. Polish accessibility & responsiveness",
                    "text": "Verify keyboard navigation, screen reader announcements, mobile layout, and behavior under reduced-motion settings."
                },
                {
                    "title": "5. Hardening & edge cases",
                    "text": "Test route changes, app teardown, error boundaries, and ensure there are no timer leaks or orphaned toasts in weird flows."
                }
            ]
        },
        {
            "type": "stats",
            "items": [
                {
                    "label": "Biggest UX risk",
                    "value": "Toast overload",
                    "helperText": "Too many notifications quickly become background noise."
                },
                {
                    "label": "Biggest tech risk",
                    "value": "Timer leaks",
                    "helperText": "Forgetting to clear timeouts on unmount can cause bugs and memory issues."
                },
                {
                    "label": "Strong senior signal",
                    "value": "Measure → then tune",
                    "helperText": "You talk about real usage, profiling and trade-offs instead of random micro-optimizations."
                }
            ]
        },
        {
            "type": "callout",
            "variant": "warning",
            "title": "Key message to land",
            "text": "A great toast system isn’t just \"it shows notifications\". It behaves well when spammed, respects accessibility and motion preferences, cleans up timers reliably, and stays readable and unobtrusive on both desktop and mobile."
        }
    ]
}